src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Comment>Документ оказания услуг, реализации товаров</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументАванса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/СписаниеЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СписаниеЗадолженности</Name>
			<Comment>Списание задолженности пациента</Comment>
			<BasedOn>
				<xr:Item>Document.Прием</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаЛицевыхСчетах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Comment>Автор документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Comment>Статья расходов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Клиника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифрокаСписания</Name>
					<Comment>Расшифровка списания</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснования</Name>
							<Comment>Документ основания</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
								<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументАванса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Comment>Сумма документа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСписания</Name>
							<Comment>Сумма списания</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоАванс</Name>
							<Comment>Это аванс от контрагента</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Получить величину задолженности по указанному документу
Функция ПолучитьЗадолженностьПоДокументу(
	ДокументСсылка,
	ВРазрезеКонтрагента = Неопределено,
	НеУчитываютсяДвижения = Неопределено,
	БезУчетаСписанияЗадолженности = Ложь) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Прием")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Реализация")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		ЗапросВыборка       = Новый Запрос;
		ЗапросВыборка.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.ДокументРеализации,
		|	ИСТИНА КАК ПризнакВыбора,
		|	- ВложенныйЗапрос.Сумма КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВзаиморасчетыСКонтрагентамиОбороты.ДокументРеализации КАК ДокументРеализации,
		|		СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаОборот) КАК Сумма
		|	ИЗ
		|		РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
		|				,
		|				,
		|				Авто,
		|				ДокументРеализации = &ДокументСсылка
		|					И ВЫБОР
		|						КОГДА &Контрагент <> НЕОПРЕДЕЛЕНО
		|							ТОГДА Контрагент = &Контрагент
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ВзаиморасчетыСКонтрагентамиОбороты
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА НЕ &НеУчитыватьДвиженияДокумента = НЕОПРЕДЕЛЕНО
		|					ТОГДА НЕ ВзаиморасчетыСКонтрагентамиОбороты.Регистратор = &НеУчитыватьДвиженияДокумента
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И ВЫБОР
		|				КОГДА &БезУчетаСписанияЗадолженности
		|					ТОГДА НЕ ВзаиморасчетыСКонтрагентамиОбороты.Регистратор ССЫЛКА Документ.СписаниеЗадолженности
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВзаиморасчетыСКонтрагентамиОбороты.ДокументРеализации) КАК ВложенныйЗапрос";
		
		ЗапросВыборка.УстановитьПараметр("ДокументСсылка"               ,ДокументСсылка);
		ЗапросВыборка.УстановитьПараметр("Контрагент"                   ,ВРазрезеКонтрагента);
		ЗапросВыборка.УстановитьПараметр("НеУчитыватьДвиженияДокумента" ,НеУчитываютсяДвижения);
		ЗапросВыборка.УстановитьПараметр("БезУчетаСписанияЗадолженности",БезУчетаСписанияЗадолженности);

		РезВыборки = ЗапросВыборка.Выполнить().Выбрать();		
		Возврат ?(РезВыборки.Следующий() ,РезВыборки.Сумма, 0);		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.НарядЗаказ") И Константы.НарядЗаказУвеличиваетЗадолженность.Получить() Тогда
        ЗапросВыборка       = Новый Запрос;
		ЗапросВыборка.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.ДокументАванса,
		|	ИСТИНА КАК ПризнакВыбора,
		|	- ВложенныйЗапрос.Сумма  КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаОборот) КАК Сумма,
		|		ВзаиморасчетыСКонтрагентамиОбороты.ДокументАванса КАК ДокументАванса
		|	ИЗ
		|		РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
		|				,
		|				,
		|				Авто,
		|				ДокументАванса = &ДокументСсылка
		|					И ВЫБОР
		|						КОГДА &Контрагент <> НЕОПРЕДЕЛЕНО
		|							ТОГДА Контрагент = &Контрагент
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ВзаиморасчетыСКонтрагентамиОбороты
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА НЕ &НеУчитыватьДвиженияДокумента = НЕОПРЕДЕЛЕНО
		|					ТОГДА НЕ ВзаиморасчетыСКонтрагентамиОбороты.Регистратор = &НеУчитыватьДвиженияДокумента
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И ВЫБОР
		|				КОГДА &БезУчетаСписанияЗадолженности
		|					ТОГДА НЕ ВзаиморасчетыСКонтрагентамиОбороты.Регистратор ССЫЛКА Документ.СписаниеЗадолженности
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВзаиморасчетыСКонтрагентамиОбороты.ДокументАванса) КАК ВложенныйЗапрос";
		
		ЗапросВыборка.УстановитьПараметр("ДокументСсылка"               ,ДокументСсылка);
		ЗапросВыборка.УстановитьПараметр("Контрагент"                   ,ВРазрезеКонтрагента);
		ЗапросВыборка.УстановитьПараметр("НеУчитыватьДвиженияДокумента" ,НеУчитываютсяДвижения);
		ЗапросВыборка.УстановитьПараметр("БезУчетаСписанияЗадолженности",БезУчетаСписанияЗадолженности);

		РезВыборки = ЗапросВыборка.Выполнить().Выбрать();		
		Возврат ?(РезВыборки.Следующий() ,РезВыборки.Сумма, 0);

	Иначе	
		ЗапросВыборка       = Новый Запрос;
		ЗапросВыборка.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0)) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(ВЫБОР
		|				КОГДА (СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаПоставщику) ИЛИ СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтклиента)) 
		|					ТОГДА СписаниеДенежныхСредствРасшифровкаПлатежа.Сумма
		|				ИНАЧЕ -СписаниеДенежныхСредствРасшифровкаПлатежа.Сумма
		|			КОНЕЦ) КАК Сумма
		|	ИЗ
		|		Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК СписаниеДенежныхСредствРасшифровкаПлатежа
		|	ГДЕ
		|		СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
		|		И (СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = &ДокументОснования
		|				ИЛИ СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументАванса = &ДокументОснования)
		|		И ВЫБОР
		|				КОГДА НЕ &НеУчитыватьДвиженияДокумента = НЕОПРЕДЕЛЕНО
		|					ТОГДА НЕ СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка = &НеУчитыватьДвиженияДокумента
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И (СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтклиента)
		|				ИЛИ СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаПоставщику)
		|				ИЛИ СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыклиенту))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СУММА(ПоступлениеДенежныхСредствРасшифровкаПлатежа.Сумма)
		|	ИЗ
		|		Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа
		|	ГДЕ
		|		ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
		|		И (ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = &ДокументОснования
		|				ИЛИ ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументАванса = &ДокументОснования)
		|		И ВЫБОР
		|				КОГДА НЕ &НеУчитыватьДвиженияДокумента = НЕОПРЕДЕЛЕНО
		|					ТОГДА НЕ ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка = &НеУчитыватьДвиженияДокумента
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И (ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтклиента)
		|				ИЛИ ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыОтПоставщика)
		|				ИЛИ ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыклиенту))) КАК ВложенныйЗапрос";
		ЗапросВыборка.УстановитьПараметр("ДокументОснования"           ,ДокументСсылка);
		ЗапросВыборка.УстановитьПараметр("НеУчитыватьДвиженияДокумента",НеУчитываютсяДвижения);

		РезВыборки = ЗапросВыборка.Выполнить().Выбрать();

		Если НЕ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.НарядЗаказ") Тогда			
			Если РезВыборки.Следующий() Тогда
				Возврат ДокументСсылка.СуммаДокумента - РезВыборки.Сумма;
			Иначе
				Возврат ДокументСсылка.СуммаДокумента;
			КонецЕсли;
		Иначе
			Если РезВыборки.Следующий() Тогда
				Возврат ДокументСсылка.СуммаПродажи - РезВыборки.Сумма;
			Иначе
				Возврат ДокументСсылка.СуммаПродажи;
			КонецЕсли;		
		КонецЕсли;

	КонецЕсли;

КонецФункции

// Получить величину задолженности по указанному контрагенту
Функция ДанныеПоВзаиморасчетамДляКонтрагента(
	Контрагент,
	КонецПериода                    = Неопределено,
	СтруктурнаяЕдиница              = Неопределено,
	ТолькоСЗадолженностьюПередНами  = Истина,
	ВключаяАвансы                   = Ложь,
	ИсключитьРегистратор            = Неопределено,
	Договор                         = Неопределено,
	Организация                     = Неопределено) Экспорт
	
	МассивСтруктурныхЕдиниц = Новый Массив;	
	МассивОрганизаций = Новый Массив();		
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Если Организация.ЭтоГоловнаяОрганизация Тогда
			
			МассивОрганизаций = Справочники.Организации.ПолучитьПодчиненныеГоловнойОрганизации(Организация); 		
			ЗапросСтрЕд = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			|ГДЕ
			|	СтруктурныеЕдиницы.Организация.ГоловнаяОрганизация.Ссылка = &Ссылка
			|	ИЛИ СтруктурныеЕдиницы.Организация.Ссылка = &Ссылка");	
			ЗапросСтрЕд.УстановитьПараметр("Ссылка", Организация);			
			МассивСтруктурныхЕдиниц = ЗапросСтрЕд.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
		КонецЕсли;
		МассивОрганизаций.Добавить(Организация);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(МассивСтруктурныхЕдиниц) И ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда		
		МассивСтруктурныхЕдиниц.Добавить(СтруктурнаяЕдиница);	
	КонецЕсли;
	
	ЗапросВыборка       = Новый Запрос;
	ЗапросВыборка.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.ДокументРеализации КАК ДокументРеализации,
	|	ВложенныйЗапрос.ДокументАванса КАК ДокументАванса,
	|	ВложенныйЗапрос.ЭтоАванс КАК ЭтоАванс,
	|	ВложенныйЗапрос.СуммаДокумента КАК СуммаДокумента,
	|	ВложенныйЗапрос.Задолженность КАК Задолженность,
	|	ВложенныйЗапрос.Оплачено КАК Оплачено
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации
	|			ИНАЧЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса
	|		КОНЕЦ КАК ДокументРеализации,
	|		ВЫБОР
	|			КОГДА &ВключаяАвансы = ИСТИНА
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса
	|		КОНЕЦ КАК ДокументАванса,
	|		ВЫБОР
	|			КОГДА &ВключаяАвансы = ИСТИНА
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ЭтоАванс
	|		КОНЕЦ КАК ЭтоАванс,
	|		ВЫБОР
	|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации.СуммаДокумента
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса <> НЕОПРЕДЕЛЕНО
	|						ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса.СуммаДокумента
	|				КОНЕЦ
	|		КОНЕЦ КАК СуммаДокумента,
	|		СУММА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаОборот) * -1 КАК Задолженность,
	|		СУММА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход) КАК Оплачено
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
	|				,
	|				&КонецПериода,
	|				Авто,
	|				,
	|				&УсловиеСтруктурнаяЕдиница
	|					И ВЫБОР
	|						КОГДА &ТолькоСЗадолженностьюПередНами = ИСТИНА
	|							ТОГДА НЕ ДокументРеализации = НЕОПРЕДЕЛЕНО
	|									ИЛИ НЕ ДокументАванса = НЕОПРЕДЕЛЕНО
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И Контрагент = &Контрагент
	|					И ВЫБОР
	|						КОГДА НЕ &Договор = НЕОПРЕДЕЛЕНО
	|								И НЕ &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|							ТОГДА Договор = &Договор
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И &УсловиеОрганизация) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &ИсключитьРегистратор <> НЕОПРЕДЕЛЕНО
	|					ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор <> &ИсключитьРегистратор
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР
	|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации
	|			ИНАЧЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &ВключаяАвансы = ИСТИНА
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &ВключаяАвансы = ИСТИНА
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ЭтоАванс
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации.СуммаДокумента
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса <> НЕОПРЕДЕЛЕНО
	|						ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса.СуммаДокумента
	|				КОНЕЦ
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ТолькоСЗадолженностьюПередНами = ИСТИНА
	|				ТОГДА ВложенныйЗапрос.Задолженность > 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументРеализации
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ЗапросВыборка.УстановитьПараметр("КонецПериода"                   ,КонецПериода);
	ЗапросВыборка.УстановитьПараметр("Контрагент"                     ,Контрагент);
	ЗапросВыборка.УстановитьПараметр("МассивСтруктурныхЕдиниц"        ,МассивСтруктурныхЕдиниц);
	ЗапросВыборка.УстановитьПараметр("ТолькоСЗадолженностьюПередНами" ,ТолькоСЗадолженностьюПередНами);
	ЗапросВыборка.УстановитьПараметр("ВключаяАвансы"                  ,ВключаяАвансы);
	ЗапросВыборка.УстановитьПараметр("ИсключитьРегистратор"           ,?(ЗначениеЗаполнено(ИсключитьРегистратор), ИсключитьРегистратор, Неопределено));
	ЗапросВыборка.УстановитьПараметр("Договор"                        ,Договор);
	ЗапросВыборка.УстановитьПараметр("МассивОрганизаций"              ,МассивОрганизаций);
	
	УсловиеСтруктурнаяЕдиница = ?(МассивСтруктурныхЕдиниц.Количество() > 0, "СтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)", "ИСТИНА");
	ЗапросВыборка.Текст = СтрЗаменить(ЗапросВыборка.Текст, "&УсловиеСтруктурнаяЕдиница", УсловиеСтруктурнаяЕдиница);
	
	УсловиеОрганизация = ?(МассивОрганизаций.Количество() > 0, "Организация В (&МассивОрганизаций)", "ИСТИНА");
	ЗапросВыборка.Текст = СтрЗаменить(ЗапросВыборка.Текст, "&УсловиеОрганизация", УсловиеОрганизация); 	
	
	Возврат ЗапросВыборка.Выполнить().Выгрузить();
	
КонецФункции

// Получить сумму остатка по взаиморасчетам с контрагентом
Функция ПолучитьОстатокПоВзаиморасчетамСконтрагентом(
	Контрагент,
	Период				= Неопределено,
	СтруктурнаяЕдиница	= Неопределено) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК Задолженность
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			&Период,
	|			Контрагент = &Контрагент
	|				И ВЫБОР
	|					КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|							И НЕ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|						ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ВзаиморасчетыСКонтрагентамиОстатки";
				   
	Запрос.УстановитьПараметр("Контрагент"        ,Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Период"            ,Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	     Возврат Выборка.Задолженность;
	 Иначе
		 Возврат 0;
	КонецЕсли;
	
КонецФункции									

// Получить сумму остаток по лицевому счету по взаиморасчетам с контрагентом
Функция ПолучитьОстатокЛицевойСчетПоВзаиморасчетамСконтрагентом(
	Контрагент,
	Период				= Неопределено,
	СтруктурнаяЕдиница	= Неопределено) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументАванса = НЕОПРЕДЕЛЕНО
	|					И ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДокументРеализации = НЕОПРЕДЕЛЕНО
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход - ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Остаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
	|			,
	|			&Период,
	|			Авто,
	|			,
	|			Контрагент = &Контрагент
	|				И ВЫБОР
	|					КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|							И НЕ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|						ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Контрагент";
				   
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Период",Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	     Возврат Выборка.Остаток;
	 Иначе
		 Возврат 0;
	КонецЕсли;

КонецФункции	

// Получить документы оплаты, для указанного документ реализации
Функция ПолучитьДокументыОплатыПоДокументуРеализации(
	ДокументРеализации,
	ТипДенежныхСредств = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОбороты.Регистратор КАК ДокументОплаты,
	|	СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаПриход) КАК СуммаОплаты
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(, , Авто, ДокументРеализации = &ДокументРеализации) КАК ВзаиморасчетыСКонтрагентамиОбороты
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиОбороты.СуммаПриход > 0
	|	И ВЫБОР
	|			КОГДА &ТипДенежныхСредств <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОбороты.Регистратор.ТипДенежныхСредств = &ТипДенежныхСредств
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОбороты.Регистратор");
	Запрос.УстановитьПараметр("ДокументРеализации",ДокументРеализации);
    Запрос.УстановитьПараметр("ТипДенежныхСредств",ТипДенежныхСредств);	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Получить сумму оплаты по документу
Функция ПолучитьСуммуОплатыПоДокументу(ДокументОснования, ИсключитьРегистратор = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаПриход), 0) КАК СуммаПриход
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(, , Авто, ДокументРеализации = &Основание) КАК ВзаиморасчетыСКонтрагентамиОбороты
	|ГДЕ
	|	(ВзаиморасчетыСКонтрагентамиОбороты.СуммаПриход > 0
	|			ИЛИ ВзаиморасчетыСКонтрагентамиОбороты.Регистратор ССЫЛКА Документ.СписаниеДенежныхСредств
	|				И ВзаиморасчетыСКонтрагентамиОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту))
	|	И ВЫБОР
	|			КОГДА &ИсключитьРегистратор <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОбороты.Регистратор <> &ИсключитьРегистратор
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("Основание"			, ДокументОснования);
	Запрос.УстановитьПараметр("ИсключитьРегистратор", ИсключитьРегистратор); // документ регистратор
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.СуммаПриход, 0);
	
КонецФункции

// Функция получает сумму оплаты по документу возврата от пациента.
//
Функция ПолучитьСуммуОплатПоДокументуВозврата(ДокументВозврата, НеУчитыватьДвижения = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокументыОплаты
	|ИЗ
	|	Документ.ПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	|	И ПоступлениеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = &ДокументВозврата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка
	|ИЗ
	|	Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК СписаниеДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	СписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	|	И СписаниеДенежныхСредствРасшифровкаПлатежа.ДокументОснования = &ДокументВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаПриход, 0)) * -1 КАК СуммаПриход
	|ИЗ
	|	ДокументыОплаты КАК ДокументыОплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(, , Регистратор, ) КАК ВзаиморасчетыСКонтрагентамиОбороты
	|		ПО ДокументыОплаты.Ссылка = ВзаиморасчетыСКонтрагентамиОбороты.Регистратор
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиОбороты.Регистратор В (ДокументыОплаты.Ссылка)
	|	И ВЫБОР
	|			КОГДА &ИсключитьРегистратор <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОбороты.Регистратор <> &ИсключитьРегистратор
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДокументВозврата"    , ДокументВозврата);
	Запрос.УстановитьПараметр("ИсключитьРегистратор", НеУчитыватьДвижения);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.СуммаПриход, 0);
	
КонецФункции

// Получить документы оплаты, для указанного документ реализации
Функция ВернутьСтруктуруОплатыПоДокументу(ДокументРеализации) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОбороты.Период КАК ДатаПлатежа,
	|	ВзаиморасчетыСКонтрагентамиОбороты.Регистратор КАК ДокументОплаты,
	|	СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаПриход) КАК СуммаОплачено,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОбороты.Регистратор ССЫЛКА Документ.Прием
	|			ТОГДА ""Зачет аванса""
	|		КОГДА ВзаиморасчетыСКонтрагентамиОбороты.Регистратор ССЫЛКА Документ.СписаниеЗадолженности
	|			ТОГДА ""Списание задолженности""
	|		ИНАЧЕ ВзаиморасчетыСКонтрагентамиОбороты.Регистратор.ТипДенежныхСредств
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиОбороты.Регистратор КАК Документ.ПоступлениеДенежныхСредств).ОплатаПоСсылке КАК ОплатаПоСсылке
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(, , Регистратор, ДокументРеализации = &ДокументРеализации) КАК ВзаиморасчетыСКонтрагентамиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОбороты.Регистратор,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОбороты.Регистратор ССЫЛКА Документ.Прием
	|			ТОГДА ""Зачет аванса""
	|		КОГДА ВзаиморасчетыСКонтрагентамиОбороты.Регистратор ССЫЛКА Документ.СписаниеЗадолженности
	|			ТОГДА ""Списание задолженности""
	|		ИНАЧЕ ВзаиморасчетыСКонтрагентамиОбороты.Регистратор.ТипДенежныхСредств
	|	КОНЕЦ,
	|	ВзаиморасчетыСКонтрагентамиОбороты.Период");
	
	Запрос.УстановитьПараметр("ДокументРеализации", ДокументРеализации);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

///////////////////////////////////////// РАБОТА С АВАНСАМИ///////////////////////////////////////////

// Получить аванса по документу
Функция ПолучитьСуммуВнесенногоАвансПоДокументу(ДокументАванса,ПериодОтбора = Неопределено) Экспорт
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаПриход) КАК СуммаПриход
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
	|			,
	|			&ПериодОтбора,
	|			,
	|			ДокументАванса = &ДокументАванса
	|				И ДокументРеализации = НЕОПРЕДЕЛЕНО) КАК ВзаиморасчетыСКонтрагентамиОбороты";
	
    Запрос.УстановитьПараметр("ДокументАванса",ДокументАванса);	
    Запрос.УстановитьПараметр("ПериодОтбора",?(ЗначениеЗаполнено(ПериодОтбора),ПериодОтбора,ТекущаяДата()));	
	Возврат Запрос.Выполнить().Выгрузить().Итог("СуммаПриход");
КонецФункции

// Получить задолженность для документа реализации по конкретному авансовому документу
Функция ПолучитьЗадолженностьПоДокументуРеализацииНаОснованииАванса(
	ДокументРеализации,
	ДокументАванса,
	ПериодОтбора = Неопределено) Экспорт
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЕстьNull(ВзаиморасчетыСКонтрагентамиОбороты.СуммаРасход, 0)) КАК СуммаРасход
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
	|			,
	|			&ПериодОтбора,
	|			,
	|			ДокументАванса = &ДокументАванса
	|				И ДокументРеализации = &ДокументРеализации) КАК ВзаиморасчетыСКонтрагентамиОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(ЕстьNull(ВзаиморасчетыСКонтрагентамиОбороты.СуммаРасход, 0))
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
	|			,
	|			&ПериодОтбора,
	|			,
	|			ВЫБОР
	|					КОГДА &ДокументОснование <> НЕОПРЕДЕЛЕНО
	|						ТОГДА ДокументАванса = &ДокументОснование
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|				И ДокументРеализации = &ДокументРеализации) КАК ВзаиморасчетыСКонтрагентамиОбороты";
	
    Запрос.УстановитьПараметр("ДокументАванса", ДокументАванса);
	Если ТипЗнч(ДокументАванса) = Тип("ДокументСсылка.НарядЗаказ") Тогда		
	    Запрос.УстановитьПараметр("ДокументОснование", ДокументАванса.ДокументОснование);	
	Иначе
		Запрос.УстановитьПараметр("ДокументОснование", Неопределено);	
	КонецЕсли;
	
    Запрос.УстановитьПараметр("ДокументРеализации", ДокументРеализации);	
    Запрос.УстановитьПараметр("ПериодОтбора",?(ЗначениеЗаполнено(ПериодОтбора),ПериодОтбора,ТекущаяДата()));	
	Возврат Запрос.Выполнить().Выгрузить().Итог("СуммаРасход");

КонецФункции

// Получить сумму аванса по взаиморасчетам с контрагентом
Функция ПолучитьОстатокАвансаПоКонтрагенту(
	Контрагент,
	Период				= Неопределено,
	СтруктурнаяЕдиница	= Неопределено,
	ТолькоБезДокАванса	= Ложь) Экспорт	
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			&Период,
	|			Контрагент = &Контрагент
	|				И ВЫБОР
	|					КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|							И НЕ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|						ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ТолькоБезДокАванса = ИСТИНА
	|						ТОГДА ДокументАванса = НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ЭтоАванс = ИСТИНА) КАК ВзаиморасчетыСКонтрагентамиОстатки";
				   
	Запрос.УстановитьПараметр("Контрагент"         ,Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница" ,СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Период"             ,Период);
	Запрос.УстановитьПараметр("ТолькоБезДокАванса" ,ТолькоБезДокАванса);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	     Возврат Выборка.СуммаОстаток;
	 Иначе
		 Возврат 0;
	КонецЕсли;

КонецФункции	

// Функция - Получить сумму остатка аванса по документу
//
Функция ПолучитьСуммуОстаткаАвансаПоДокументу(ДокументЗадолженности, МассивДокументовАванса) Экспорт
	
	Запрос       = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументАванса КАК ДокументАванса,
	|	СУММА(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток) КАК СуммаОстатокАванса
	|ПОМЕСТИТЬ ВТАвансы
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			ДокументАванса В (&МассивОснований)
	|				И ЭтоАванс = ИСТИНА) КАК ВзаиморасчетыСКонтрагентамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументАванса
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТАвансы.ДокументАванса КАК ДокументАванса,
	|	СУММА(ВТАвансы.СуммаОстатокАванса) КАК СуммаОстатокАванса,
	|	СУММА(ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаПриход, 0)) КАК СуммаВнесенногоАванса
	|ПОМЕСТИТЬ ВТВнесенныеАвансы
	|ИЗ
	|	ВТАвансы КАК ВТАвансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
	|				,
	|				,
	|				Авто,
	|				ДокументАванса В (&МассивОснований)
	|					И ЭтоАванс = ИСТИНА) КАК ВзаиморасчетыСКонтрагентамиОбороты
	|		ПО ВТАвансы.ДокументАванса = ВзаиморасчетыСКонтрагентамиОбороты.ДокументАванса
	|			И (ВзаиморасчетыСКонтрагентамиОбороты.Регистратор = &ДокументЗадолженности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТАвансы.ДокументАванса
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТАвансы.СуммаОстатокАванса) + СУММА(ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаПриход, 0)) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаРасход, 0)) КАК СуммаВозможнойОплаты,
	|	ВзаиморасчетыСКонтрагентамиОбороты.ДокументАванса КАК ДокументАванса
	|ПОМЕСТИТЬ ВТВозможнаяОплатаПриема
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
	|			,
	|			,
	|			,
	|			ДокументАванса В (&МассивОснований)
	|				И ДокументРеализации = &ДокументЗадолженности) КАК ВзаиморасчетыСКонтрагентамиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОбороты.ДокументАванса
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаРасход, 0)) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВнесенныеАвансы.ДокументАванса КАК ДокументАванса,
	|	ЕСТЬNULL(ВТВнесенныеАвансы.СуммаОстатокАванса, 0) КАК СуммаОстатокАванса,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТВозможнаяОплатаПриема.СуммаВозможнойОплаты, 0) + ЕСТЬNULL(ВТВнесенныеАвансы.СуммаВнесенногоАванса, 0) < ЕСТЬNULL(ВТВнесенныеАвансы.СуммаОстатокАванса, 0)
	|				И ЕСТЬNULL(ВТВозможнаяОплатаПриема.СуммаВозможнойОплаты, 0) + ЕСТЬNULL(ВТВнесенныеАвансы.СуммаВнесенногоАванса, 0) > 0
	|			ТОГДА ЕСТЬNULL(ВТВозможнаяОплатаПриема.СуммаВозможнойОплаты, 0) + ЕСТЬNULL(ВТВнесенныеАвансы.СуммаВнесенногоАванса, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВТВнесенныеАвансы.СуммаОстатокАванса, 0)
	|	КОНЕЦ КАК СуммаДоступнаяДляОплатыАвансом
	|ИЗ
	|	ВТВнесенныеАвансы КАК ВТВнесенныеАвансы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВозможнаяОплатаПриема КАК ВТВозможнаяОплатаПриема
	|		ПО ВТВнесенныеАвансы.ДокументАванса = ВТВозможнаяОплатаПриема.ДокументАванса
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТВозможнаяОплатаПриема.СуммаВозможнойОплаты, 0) + ЕСТЬNULL(ВТВнесенныеАвансы.СуммаВнесенногоАванса, 0) < ЕСТЬNULL(ВТВнесенныеАвансы.СуммаОстатокАванса, 0)
	|					И ЕСТЬNULL(ВТВозможнаяОплатаПриема.СуммаВозможнойОплаты, 0) + ЕСТЬNULL(ВТВнесенныеАвансы.СуммаВнесенногоАванса, 0) > 0
	|				ТОГДА ЕСТЬNULL(ВТВозможнаяОплатаПриема.СуммаВозможнойОплаты, 0) + ЕСТЬNULL(ВТВнесенныеАвансы.СуммаВнесенногоАванса, 0)
	|			ИНАЧЕ ЕСТЬNULL(ВТВнесенныеАвансы.СуммаОстатокАванса, 0)
	|		КОНЕЦ > 0";
	
	Запрос.УстановитьПараметр("МассивОснований"      , МассивДокументовАванса);
	Запрос.УстановитьПараметр("ДокументЗадолженности", ДокументЗадолженности);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции	

// Получить величину задолженности по документам
Функция ПолучитьЗадолженностьПоДокументам(МассивДокументов, НеУчитываетсяРегистратор = Неопределено, СтруктурнаяЕдиница) Экспорт
	
	ЗапросВыборка       = Новый Запрос; 
	Если НеУчитываетсяРегистратор = Неопределено Тогда
		ЗапросВыборка.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	-ЕСТЬNULL(СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаОборот), 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
		|			,
		|			,
		|			,
		|			ДокументРеализации В (&МассивДокументов)
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ВзаиморасчетыСКонтрагентамиОбороты";
	Иначе  
		ЗапросВыборка.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	-ЕСТЬNULL(СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаОборот), 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
		|			,
		|			,
		|			Авто,
		|			ДокументРеализации В (&МассивДокументов)
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ВзаиморасчетыСКонтрагентамиОбороты
		|ГДЕ
		|	ВзаиморасчетыСКонтрагентамиОбороты.Регистратор <> &НеУчитываетсяРегистратор";   
		ЗапросВыборка.УстановитьПараметр("НеУчитываетсяРегистратор", НеУчитываетсяРегистратор);
	КонецЕсли;
	ЗапросВыборка.УстановитьПараметр("МассивДокументов", МассивДокументов); 
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);

	РезВыборки = ЗапросВыборка.Выполнить().Выбрать();		
	Возврат ?(РезВыборки.Следующий(), ?(РезВыборки.Сумма < 0, 0, РезВыборки.Сумма), 0);		
	
КонецФункции

#КонецОбласти
